---
kind: method
id: M:Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetAllMassSubCategoryIds
source: html/6b3c66dc-1276-b767-68ea-4c2c223af170.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetAllMassSubCategoryIds Method

Get all the mass subcategory ids for which there are ConceptualSurfaceType's.

## Syntax (C#)
```csharp
public static IList<ElementId> GetAllMassSubCategoryIds()
```

## Returns
Returns an array of element id of mass subcategories for which there are ConceptualSurfaceType's.